SeongMin1000/N6_cusotm_validation/Projects/STM32N6570-DK/Applications/NPU_Custom_Validation/X-CUBE-AI/atonn/ai_wrapper_ATON.c
/**
******************************************************************************
* @file    ai_wrapper_ATON.c
* @author  GPM/AIS Application Team
* @brief   AI Atonn wrapper
******************************************************************************
* @attention
*
* Copyright (c) 2023,2024,2025 STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/

#include "ai_wrapper_ATON.h"
#include "stm32n6xx_hal.h"

#include "ll_aton.h"
#include "ll_aton_runtime.h"
#include "ll_aton_cipher.h"
#include "ll_aton_dbgtrc.h"
#include "ll_aton_version.h"
#include "ll_aton_caches_interface.h"


#define ATONN_RT_VERSION (LL_ATON_VERSION_MAJOR << 24 | LL_ATON_VERSION_MINOR << 16 | LL_ATON_VERSION_MICRO << 8 | 0)
#define ATONN_RT_DESC    LL_ATON_VERSION_NAME
// Neural-Art encryption configuration (encryption ID + bus interface keys)
#define ENCRYPTION_ID                       0
#define BUSIF_LSB_KEY      0xAABBCCDDAABBCCDD
#define BUSIF_MSB_KEY      0xAABBCCDDAABBCCDD


#include "app_config.h"

#include "aiTestUtility.h"

#if !defined(LL_ATON_RT_RELOC) && defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1
#warning "LL_ATON_RT_RELOC should be set to use the RELOC MODE"
#undef USE_RELOC_MODE
#endif

#ifdef CACHEAXI

#define USE_COUNTER_NPU_CACHE           1

int npu_cache_counters_enable(void)
{
  if (CACHEAXI->CR1 & CACHEAXI_CR1_EN) {
    CACHEAXI->CR1 |= 0x33330000UL;
    CACHEAXI->CR1 |= 0xCCCC0000UL;
    return 0;
  }
  return 1;
}

int npu_cache_counters_disable(void)
{
  if (CACHEAXI->CR1 & CACHEAXI_CR1_EN) {
    CACHEAXI->CR1 &= ~0xFFFF0000UL;
    return 0;
  }
  return 1;
}

int npu_cache_counters_get(uint32_t *counters)
{
  if ((CACHEAXI->CR1 & CACHEAXI_CR1_EN) && counters) {
    __IO uint32_t *base = &(CACHEAXI->RHMONR);
    for (int i=0; i<8; i++) {
      counters[i] = base[i];
    }
    return 0;
  }
  return 1;
}
#else
#define USE_COUNTER_NPU_CACHE           0

#endif


#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1

#include "ll_aton_reloc_network.h"

/*

 PSRAM (32MB)

  0x9000 0000  -----------------
                 reserv.          max. 1MB
  0x9010 0000  -----------------
                 ext RAM          max. 27MB
  0x91C0 0000  -----------------
                 ext EXE RAM      max. 4MB
  0x9200 0000  -----------------


 FLASH (128MB)

  0x7000 0000  -----------------
                  reserv.         16MB
  0x7100 0000  -----------------
                  IMG0            8MB
  0x7180 0000  -----------------
                 (PARAM0)         104MB
  0x7800 0000  -----------------

*/

#define _RELOC_EXT_RAM_ADDR           (0x90100000)        // +1MB
#define _RELOC_MAX_EXT_RAM_SZ         (27 * 1024 * 1024)  // 27MB

#define _RELOC_BASE_ADDR_0            (0x71000000)        // +16MB
#define _RELOC_BASE_PARAMS_ADDR_0     (0x71800000)        // +24MB

#define _RELOC_BASE_ADDR_1            (0x90000000)

#if defined(USE_RELOC_EXT_EXEC_RAM) && USE_RELOC_EXT_EXEC_RAM == 1

#define _RELOC_EXEC_RAM_ADDR   (0x91C00000)
#define _RELOC_MAX_EXEC_RAM_SZ  (4 * 1024 * 1024)  /* 4MB */

#else

#define _RELOC_MAX_EXEC_RAM_SZ  ((512 + 128) * 1024)  /* 512 + 128 KB */

// uint64_t exec_ram[_RELOC_MAX_EXE_RAM_SZ / 8];

// #define _RELOC_EXEC_RAM_ADDR  (&exec_ram[0])
// #define _RELOC_EXEC_RAM_ADDR  (0x24350000)  /* npuRAM6 */
// #define _RELOC_EXEC_RAM_ADDR  (0x34100000)  /* AXIRAM2 */

/* AXIRAM1 + 256+128 KB (512+128 KB is reserved for the exec RAM */
#define _RELOC_EXEC_RAM_ADDR   (0x34060000)
#endif

#if defined(USE_RELOC_XIP_MODE) && USE_RELOC_XIP_MODE == 1
#define _USED_RELOC_MODE   AI_RELOC_RT_LOAD_MODE_XIP
#else
#define _USED_RELOC_MODE   AI_RELOC_RT_LOAD_MODE_COPY
#endif


static NN_Instance_TypeDef NN_Instance_Default;

#else /* !USE_RELOC_MODE */

// LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(Default)
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(kws) 
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(img)  

#endif


uint32_t get_ll_buffer_size(const LL_Buffer_InfoTypeDef *aton_buf)
{
  return LL_Buffer_len(aton_buf);
}

uint32_t get_ll_element_size(const LL_Buffer_InfoTypeDef *aton_buf)
{
  return (size_t)(aton_buf->nbits / 8);
}

/*
* Return a pointer of the instance for a given model
*/

static NN_Instance_TypeDef* _get_nn_instance(int idx)
{
  if (idx > 1)
    return NULL;

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1

  int res;
  uint32_t *rom_addr = (uint32_t *)_RELOC_BASE_ADDR_1;
  uintptr_t ext_param_addr = NULL;

  if (AI_RELOC_MAGIC != *rom_addr) {
    rom_addr = (uint32_t *)_RELOC_BASE_ADDR_0;
  }

  if (AI_RELOC_MAGIC != *rom_addr)
    return NULL;

  ll_aton_reloc_info rt;

  ll_aton_reloc_log_info((uintptr_t)rom_addr);

  // Retrieve the info from the binary objects. Requested RAM size,...
  res = ll_aton_reloc_get_info((uintptr_t)rom_addr, &rt);

  if (rt.params_off == 0)
    ext_param_addr = _RELOC_BASE_PARAMS_ADDR_0;

  if (res || rt.ext_ram_sz > _RELOC_MAX_EXT_RAM_SZ)
    return NULL;

  // Create and install an instance of the relocatable model
  ll_aton_reloc_config config;
  config.exec_ram_addr = (uintptr_t)_RELOC_EXEC_RAM_ADDR;
  config.exec_ram_size = _RELOC_MAX_EXEC_RAM_SZ;
  config.ext_ram_addr = (uintptr_t)_RELOC_EXT_RAM_ADDR;
  config.ext_ram_size = rt.ext_ram_sz;
  config.ext_param_addr = ext_param_addr;
  config.mode = _USED_RELOC_MODE; // AI_RELOC_RT_LOAD_MODE_CLEAR

  res = ll_aton_reloc_install((uintptr_t)rom_addr, &config, &NN_Instance_Default);

  if (res)
    return NULL;

  return &NN_Instance_Default;

#else
  // [수정] idx가 0이면 kws, 1이면 img 반환 
  if (idx == 0) { 
    return &NN_Instance_kws; 
  } 
  else if (idx == 1) { 
    return &NN_Instance_img; 
  } 
  else { 
    return NULL; // 잘못된 인덱스 
  } 
#endif
}

#if !defined(USE_RELOC_MODE) || (defined(USE_RELOC_MODE) && USE_RELOC_MODE != 1)

