SeongMin1000/N6_cusotm_validation/Projects/STM32N6570-DK/Applications/NPU_Custom_Validation/X-CUBE-AI/atonn/ai_wrapper_ATON.c
/*
* Return the size of the parameters/weights in bytes
*/
static uint32_t _get_nn_params_size(const struct npu_instance *instance, bool *has_no_desc)
{
  const LL_Buffer_InfoTypeDef *aton_buf;

  uint32_t total = 0;

  if ((!instance) || (!has_no_desc))
    return 0;

  *has_no_desc = true;

  const LL_Buffer_InfoTypeDef* input_buffs = npu_get_input_buffers_info(instance, -1);

  if (!input_buffs) {
    return total;
  }

  for (aton_buf = input_buffs; aton_buf->name != NULL; aton_buf++) {
    if (aton_buf->is_param == 1) {
      *has_no_desc = false;
      total += get_ll_buffer_size(aton_buf);
    }
  }
  return total;
}

/*
* Return the size of the used memory region
*/
static uint32_t _get_used_size_from_region(uintptr_t addr_min, uintptr_t addr_max,
                                           const LL_Buffer_InfoTypeDef *buffs)
{
  const LL_Buffer_InfoTypeDef *aton_buf;
  uintptr_t min = addr_max;
  uintptr_t max = addr_min;
  uint32_t total = 0;

  for (aton_buf = buffs; aton_buf->name != NULL; aton_buf++) {

    const uintptr_t start_addr = (uintptr_t)LL_Buffer_addr_start(aton_buf);
    const uintptr_t end_addr = (uintptr_t)LL_Buffer_addr_end(aton_buf) - 1;

    if ((start_addr <= addr_min) && (end_addr >= addr_max)) {
      return (uint32_t)(addr_max - addr_min + 1);
    }
    if ((start_addr >= addr_min) && (end_addr <= addr_max)) {
      min = start_addr < min ? start_addr : min;
      max = end_addr > max ? end_addr : max;
      total = max - min + 1;
    }
    else if ((start_addr >= addr_min) && (start_addr <= addr_max)) {
      min = start_addr < min ? start_addr : min;
      max = addr_max;
      total = max - min + 1;
    }
    else if ((end_addr >= addr_min) && (end_addr <= addr_max)) {
      min = addr_min;
      max = end_addr > max ? end_addr : max;
      total = max - min + 1;
    }
  }

  return total;
}

/*
* Return the size of the activations in bytes
*/
static uint32_t _get_nn_activations_size(const struct npu_instance *instance, bool *has_no_desc)
{
  uint32_t total = 0;

  if ((!instance) || (!has_no_desc))
    return 0;

  *has_no_desc = false;

  const LL_Buffer_InfoTypeDef* internal_buffs = npu_get_internal_buffers_info(instance);

  if ((!internal_buffs)) {
    *has_no_desc = true;
    return 0;
  }

  /* AXIRAM1-2 */
  for (uintptr_t addr = 0x34000000UL; addr < 0x34200000UL; addr += (1024 * 1024)) {
    total += _get_used_size_from_region(addr, addr + (1024 * 1024) - 1,
                                        internal_buffs);
    uintptr_t ns_addr = addr - 0x10000000UL;
    total += _get_used_size_from_region(ns_addr, ns_addr + (1024 * 1024) - 1,
                                        internal_buffs);

  }

  /* AXIRAM3-4-5-6 */
  for (uintptr_t addr = 0x34200000UL; addr < 0x343C0000UL; addr += (448 * 1024)) {
    total += _get_used_size_from_region(addr, addr + (448 * 1024) - 1,
                                        internal_buffs);
    uintptr_t ns_addr = addr - 0x10000000UL;
    total += _get_used_size_from_region(ns_addr, ns_addr + (448 * 1024) - 1,
                                        internal_buffs);
  }

  /* NPU Cache */
  total += _get_used_size_from_region((uintptr_t)0x343C0000UL, (uintptr_t)0x34400000UL - 1,
                                        internal_buffs);

  total += _get_used_size_from_region((uintptr_t)0x243C0000UL, (uintptr_t)0x24400000UL - 1,
                                        internal_buffs);

  /* External */
  total += _get_used_size_from_region((uintptr_t)0x60000000UL, (uintptr_t)0xA0000000UL,
                                        internal_buffs);
  return total;
}

#endif


static uint32_t _get_nn_epochs_num(const NN_Instance_TypeDef* nn_inst)
{

  if (!nn_inst)
    return 0;

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1
  const EpochBlock_ItemTypeDef* epochs_list = ai_rel_network_get_epoch_items(nn_inst->exec_state.inst_reloc);
#else
  const EpochBlock_ItemTypeDef* epochs_list = nn_inst->network->epoch_block_items();
#endif

  int16_t epoch_num = 0;
  const EpochBlock_ItemTypeDef* epochs = epochs_list;
  while (epochs->flags != EpochBlock_Flags_last_eb)
  {
    epoch_num++;
    epochs++;
  }

  return (uint32_t)epoch_num;
}

static void _populate_nn_info(struct npu_instance *instance)
{
  const LL_Buffer_InfoTypeDef *aton_buf;

  if ((!instance) || (!instance->impl))
    return;

  const NN_Instance_TypeDef* nn_inst = instance->impl;
  struct npu_model_info *nn_info = &instance->info;

  nn_info->flags |= NPU_MODEL_INFO_FLAGS_NO_MACC;
  nn_info->compile_datetime =  __DATE__ " " __TIME__;

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1
  nn_info->flags |= NPU_MODEL_INFO_FLAGS_RELOC;

  if (ll_aton_reloc_is_valid(nn_inst) <= 0)
    return;

  ll_aton_reloc_info m_info;
  uintptr_t file_ptr;

  ll_aton_reloc_get_file_ptr(nn_inst, &file_ptr);
  ll_aton_reloc_get_info(file_ptr, &m_info);

  nn_info->version = m_info.rt_version;
  nn_info->rt_desc = m_info.rt_version_desc;
  nn_info->params = m_info.params_sz;
  nn_info->name = m_info.c_name;
  nn_info->activations = m_info.acts_sz;

#else  /* !USE_RELOC_MODE */

  nn_info->version = ATONN_RT_VERSION;
  nn_info->rt_desc = ATONN_RT_DESC;

  // [수정] 인스턴스 주소를 비교해서 이름을 다르게 설정 
  if (instance->impl == &NN_Instance_img) { 
    nn_info->name = "img"; 
  } 
  else if (instance->impl == &NN_Instance_kws) { 
    nn_info->name = "kws"; 
  } 

  bool has_no_desc;

  nn_info->params = _get_nn_params_size(instance, &has_no_desc);
  if (has_no_desc)
    nn_info->flags |= NPU_MODEL_INFO_FLAGS_NO_PARAMS;

  nn_info->activations = _get_nn_activations_size(instance, &has_no_desc);
  if (has_no_desc)
    nn_info->flags |= NPU_MODEL_INFO_FLAGS_NO_ACTS;

#endif

  nn_info->n_inputs = 0;
  while (aton_buf = npu_get_input_buffers_info(instance, nn_info->n_inputs))
  {
    nn_info->in_bufs[nn_info->n_inputs] = aton_buf;
    nn_info->n_inputs += 1;
  }

  nn_info->n_outputs = 0;
  while (aton_buf = npu_get_output_buffers_info(instance, nn_info->n_outputs))
  {
    nn_info->out_bufs[nn_info->n_outputs] = aton_buf;
    nn_info->n_outputs += 1;
  }

  nn_info->n_epochs = _get_nn_epochs_num(nn_inst);

  /* no IO configuration */

  if (nn_info->n_inputs) {
    uint8_t *input_addr = LL_Buffer_addr_start(nn_info->in_bufs[0]);
    if (!input_addr)
      nn_info->flags |= NPU_MODEL_INFO_FLAGS_NO_IN_ALLOC;
  }

  if (nn_info->n_inputs) {
    uint8_t *input_addr = LL_Buffer_addr_start(nn_info->in_bufs[0]);
    if (!input_addr)
      nn_info->flags |= NPU_MODEL_INFO_FLAGS_NO_OUT_ALLOC;
  }

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1

#if 0  // TEST purpose

#define YOLOV5

