SeongMin1000/N6_cusotm_validation/Projects/STM32N6570-DK/Applications/NPU_Custom_Validation/X-CUBE-AI/atonn/ai_wrapper_ATON.c
#ifdef YOLOV5
#define S_IN_0      150528
#define S_OUT_0     18522
#endif

#ifdef MOBV2
#define S_IN_0      150528
#define S_OUT_0     20
#endif


  _Pragma("data_alignment=32") static uint64_t buff_in[S_IN_0 / 8 + 1];
  _Pragma("data_alignment=32") static uint64_t buff_out[S_OUT_0 / 8 + 1];

  if (nn_info->flags & NPU_MODEL_INFO_FLAGS_NO_IN_ALLOC) {
      LL_ATON_User_IO_Result_t res = ll_aton_reloc_set_input(nn_inst, 0, &buff_in[0], S_IN_0);
      void *addr = ll_aton_reloc_get_input(nn_inst, 0);
      if (addr != (void*)&buff_in[0])
        return;
  }

  if (nn_info->flags & NPU_MODEL_INFO_FLAGS_NO_OUT_ALLOC) {
      LL_ATON_User_IO_Result_t res = ll_aton_reloc_set_output(nn_inst, 0, &buff_out[0], S_OUT_0);
      void *addr = ll_aton_reloc_get_output(nn_inst, 0);
      if (addr != (void*)&buff_out[0])
        return;
  }
#endif
#endif
}


/*
* Internal structure to handle
* the current ATON execution context
*/
struct _npu_exec_context
{
  uint32_t mode;                      /* exec mode */
  uint64_t cpu_cycles_start;          /* Accumulated number of CPU cycles between PRE_START and POST_START */
  uint64_t cpu_cycles_npu;            /* Accumulated number of CPU cycles between POST_START and PRE_END (npu core) */
  uint64_t cpu_cycles_end;            /* Accumulated number of CPU cycles between PRE_END and POST_END */

  uint64_t cpu_cycles_all;
  uint64_t npu_cycles_all;

  uint16_t exec_epoch_idx;

  npu_user_cb user_cb;

  struct npu_epoch_counters cur_epoch;
};


struct _npu_exec_context g_npu_exec_ctx;


#define _NPU_CLK_COUNTER         0
#define _STRENG_COUNTER_IDX      1


void _dump_streng_counters(uint32_t mask, uint32_t *counters)
{
  int i;
  int counter = _STRENG_COUNTER_IDX;
  uint32_t *pw = counters;
  for (i = 0; i < ATON_STRENG_NUM; i++)
  {
    if (mask & (1 << i))
      *pw++ = LL_Dbgtrc_Counter_Read(0, counter++);
  }
}

__STATIC_INLINE void _init_npu_free_counter(void)
{
    LL_Dbgtrc_Counter_InitTypdef counter_init;
    counter_init.signal = DBGTRC_VDD;
    counter_init.evt_type = DBGTRC_EVT_HI;
    counter_init.wrap = 0;
    counter_init.countdown = 0;
    counter_init.int_disable = 1;
    counter_init.counter = 0;
    LL_Dbgtrc_Counter_Init(0, _NPU_CLK_COUNTER, &counter_init);
    LL_Dbgtrc_Counter_Start(0, _NPU_CLK_COUNTER);
}

__STATIC_INLINE void _reset_npu_free_counter(uint32_t fmt)
{
  if (fmt & COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN)) {
    volatile uint32_t *reg = (volatile uint32_t *)(ATON_DEBUG_TRACE_EVENT_CNT_ADDR(0, _NPU_CLK_COUNTER));
    *reg = 0;
  }
}

__STATIC_INLINE void _deinit_npu_free_counter(void)
{
    LL_Dbgtrc_Counter_Stop(0, _NPU_CLK_COUNTER);
}

__STATIC_INLINE uint32_t _get_cycles_npu_free_counter(uint32_t fmt)
{
  if (fmt & COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN))
    return LL_Dbgtrc_Counter_Read(0, _NPU_CLK_COUNTER);
  return 0;
}


static void _npu_counters_PRE_START(struct _npu_exec_context *ctx,
                                    const LL_ATON_RT_EpochBlockItem_t *epoch_block)
{

  /* Set/check the supported config for the counters */

  ctx->cur_epoch.counter_fmt = 0;

  if ((ctx->mode & COUNTER_OPT_EPOCH_LEN) && (!(ctx->mode & COUNTER_OPT_BUSIF_RW_DATA))) // EPOCH_LEN only
  {
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN);
  }

  if (ctx->mode & COUNTER_OPT_STRG_I_ACTIVE) // STRENG_ACTIVE ALL IN
  {
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_STRG_I_ACTIVE);
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN);
  }
  else if (ctx->mode & COUNTER_OPT_STRG_O_ACTIVE) // STRENG_ACTIVE ALL OUT
  {
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_STRG_O_ACTIVE);
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN);
  }
  else if (ctx->mode & COUNTER_OPT_STRG_ACTIVE) // STRENG_ACTIVE
  {
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_STRG_ACTIVE);
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN);
  }
  else if (ctx->mode & COUNTER_OPT_STRG_HENV) // STRENG_HENV
  {
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_STRG_HENV);
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN);
  }
  else if (ctx->mode & COUNTER_OPT_BUSIF_RW_DATA) // PORT_RW_BURSTLEN
  {
    // all counters are used, EPOCH_LEN can be not used
    ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_BUSIF_RW_DATA);
  }

#if USE_COUNTER_NPU_CACHE
  if (ctx->mode & COUNTER_OPT_NPU_CACHE) // NPU_CACHE
  {
	ctx->cur_epoch.counter_fmt |= COUNTER_FMT_OPT(COUNTER_OPT_NPU_CACHE);
  }
#endif

  /* Enable the counters - PRE_START */

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN)) {
    _init_npu_free_counter();
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_BUSIF_RW_DATA))
  {
    LL_Dbgtrc_BurstLenBenchStart(0);
    g_npu_exec_ctx.cur_epoch.counter_fmt |= NPU_MAX_COUNTERS;
  }

#if USE_COUNTER_NPU_CACHE
  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_NPU_CACHE))
  {
    npu_cache_counters_enable();
  }
#endif

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_I_ACTIVE))
  {
    ctx->cur_epoch.counter_fmt |= LL_Dbgtrc_Count_StrengActive_Config(0x3FF, 0,
                                                                    _STRENG_COUNTER_IDX);
    if (COUNTER_FMT_NUMBER(ctx->cur_epoch.counter_fmt) > 0) {
      LL_Dbgtrc_Count_StrengActive_Start(0x3FF, 0, _STRENG_COUNTER_IDX);
    }
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_O_ACTIVE))
  {
    ctx->cur_epoch.counter_fmt |= LL_Dbgtrc_Count_StrengActive_Config(0, 0x3FF,
                                                                    _STRENG_COUNTER_IDX);
    if (COUNTER_FMT_NUMBER(ctx->cur_epoch.counter_fmt) > 0) {
      LL_Dbgtrc_Count_StrengActive_Start(0, 0x3FF, _STRENG_COUNTER_IDX);
    }
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_ACTIVE))
  {
    ctx->cur_epoch.counter_fmt |= LL_Dbgtrc_Count_StrengActive_Config(epoch_block->in_streng_mask,
                                                                      epoch_block->out_streng_mask,
                                                                      _STRENG_COUNTER_IDX);
    if (COUNTER_FMT_NUMBER(ctx->cur_epoch.counter_fmt) > 0) {
      LL_Dbgtrc_Count_StrengActive_Start(epoch_block->in_streng_mask,
                                         epoch_block->out_streng_mask,
                                         _STRENG_COUNTER_IDX);
    }
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_HENV))
  {
    ctx->cur_epoch.counter_fmt |= LL_Dbgtrc_Count_StrengHENV_Config(epoch_block->in_streng_mask,
                                                                    _STRENG_COUNTER_IDX);
    if (COUNTER_FMT_NUMBER(ctx->cur_epoch.counter_fmt) > 0) {
      LL_Dbgtrc_Count_StrengHENV_Start(epoch_block->in_streng_mask,
                                       _STRENG_COUNTER_IDX);

