SeongMin1000/N6_cusotm_validation/Projects/STM32N6570-DK/Applications/NPU_Custom_Validation/X-CUBE-AI/atonn/ai_wrapper_ATON.c
    }
  }
}

static void _npu_counters_POST_START(struct _npu_exec_context *ctx,
                                    const LL_ATON_RT_EpochBlockItem_t *epoch_block)
{

}

static void _npu_counters_PRE_END(struct _npu_exec_context *ctx, const uint32_t ts_npu,
                                  const LL_ATON_RT_EpochBlockItem_t *epoch_block)
{
}

static void _npu_counters_POST_END(struct _npu_exec_context *ctx, const uint32_t ts_npu,
                                   const LL_ATON_RT_EpochBlockItem_t *epoch_block)
{
  /* Read the counters */
#if USE_COUNTER_NPU_CACHE
  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_NPU_CACHE))
  {
    npu_cache_counters_get(&g_npu_exec_ctx.cur_epoch.cache_counters[0]);
    npu_cache_counters_disable();
  }
#endif

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_I_ACTIVE))
  {
    LL_Dbgtrc_Count_StrengActive_Stop(0x3FF, 0x0, _STRENG_COUNTER_IDX);
    _dump_streng_counters(0x3FF, &ctx->cur_epoch.counters[0]);
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_O_ACTIVE))
  {
    LL_Dbgtrc_Count_StrengActive_Stop(0x0, 0x3FF, _STRENG_COUNTER_IDX);
    _dump_streng_counters(0x3FF, &ctx->cur_epoch.counters[0]);
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_ACTIVE))
  {
    LL_Dbgtrc_Count_StrengActive_Stop(epoch_block->in_streng_mask,
                                      epoch_block->out_streng_mask,
                                      _STRENG_COUNTER_IDX);
    _dump_streng_counters(epoch_block->in_streng_mask | epoch_block->out_streng_mask,
                          &ctx->cur_epoch.counters[0]);
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_STRG_HENV))
  {
    LL_Dbgtrc_Count_StrengHENV_Stop(epoch_block->in_streng_mask, _STRENG_COUNTER_IDX);
    _dump_streng_counters(epoch_block->in_streng_mask,
                          &ctx->cur_epoch.counters[0]);
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_BUSIF_RW_DATA))
  {
    LL_Dbgtrc_BurstLenGet(0, (unsigned int *)&ctx->cur_epoch.counters[0]);
  }

  if (ctx->cur_epoch.counter_fmt & COUNTER_FMT_OPT(COUNTER_OPT_EPOCH_LEN)) {
    _deinit_npu_free_counter();
  }
}

void _rt_callback(LL_ATON_RT_Callbacktype_t ctype)
{
  if(ctype == LL_ATON_RT_Callbacktype_RT_Init){
    /* Initialize Debug and Trace Unit counter */
    LL_Dbgtrc_EnableClock();
    LL_Dbgtrc_Init(0);
  }
  else {
    LL_Dbgtrc_Deinit(0);
    LL_Dbgtrc_DisableClock();
  }
}


/* Callbacks used for benchmarking purposes */
static void _epoch_callback(LL_ATON_RT_Callbacktype_t ctype,
                            const NN_Instance_TypeDef *nn_instance,
                            const LL_ATON_RT_EpochBlockItem_t *epoch_block)
{
  const uint32_t ts = port_dwt_get_cycles();
  const uint32_t ts_npu = _get_cycles_npu_free_counter(g_npu_exec_ctx.cur_epoch.counter_fmt);

  if (ctype == LL_ATON_RT_Callbacktype_PRE_START)
  {
    g_npu_exec_ctx.cur_epoch.npu_core = 0;
    g_npu_exec_ctx.cpu_cycles_all += ts;

    if (g_npu_exec_ctx.user_cb != NULL) {
      g_npu_exec_ctx.user_cb(ctype, g_npu_exec_ctx.exec_epoch_idx, epoch_block, NULL);
    }

    g_npu_exec_ctx.cur_epoch.counter_fmt = 0;
#if defined(USE_NPU_COUNTERS) && USE_NPU_COUNTERS == 1
    _npu_counters_PRE_START(&g_npu_exec_ctx, epoch_block);
#endif

    g_npu_exec_ctx.exec_epoch_idx += 1;
    _reset_npu_free_counter(g_npu_exec_ctx.cur_epoch.counter_fmt);
  }

  else if (ctype == LL_ATON_RT_Callbacktype_POST_START)
  {
    g_npu_exec_ctx.cur_epoch.npu_start = ts_npu;
    g_npu_exec_ctx.cpu_cycles_start += ts;
    g_npu_exec_ctx.cur_epoch.cpu_start = ts;

    if (g_npu_exec_ctx.mode)
      _npu_counters_POST_START(&g_npu_exec_ctx, epoch_block);
  }

  else if (ctype == LL_ATON_RT_Callbacktype_PRE_END)
  {
    g_npu_exec_ctx.cur_epoch.npu_core = ts_npu - g_npu_exec_ctx.cur_epoch.npu_start;
    g_npu_exec_ctx.cur_epoch.npu_end = ts_npu;

    if (g_npu_exec_ctx.mode)
      _npu_counters_PRE_END(&g_npu_exec_ctx, ts_npu, epoch_block);

    g_npu_exec_ctx.npu_cycles_all += g_npu_exec_ctx.cur_epoch.npu_core;
    g_npu_exec_ctx.cpu_cycles_npu += ts;
    g_npu_exec_ctx.cur_epoch.cpu_core = ts;
  }

  else if (ctype == LL_ATON_RT_Callbacktype_POST_END)
  {
    g_npu_exec_ctx.cur_epoch.npu_end = ts_npu - g_npu_exec_ctx.cur_epoch.npu_end;
    g_npu_exec_ctx.cpu_cycles_end += ts;
    g_npu_exec_ctx.cur_epoch.cpu_end = ts;

    if (g_npu_exec_ctx.mode)
      _npu_counters_POST_END(&g_npu_exec_ctx, ts_npu, epoch_block);

    if (g_npu_exec_ctx.user_cb != NULL) {
      g_npu_exec_ctx.user_cb(ctype, g_npu_exec_ctx.exec_epoch_idx - 1, epoch_block, &g_npu_exec_ctx.cur_epoch);
    }
  };

  port_dwt_reset();
}

/* ATON software reset */
static void _npu_internal_reset(void)
{
  uint32_t t;

  /* Clear pipeline */
  t = ATON_CLKCTRL_CTRL_GET(0);
  t = ATON_CLKCTRL_CTRL_SET_CLR(t, 1);
  ATON_CLKCTRL_CTRL_SET(0, t);
}

#define AI_RELOC_ROUND_UP_32B(_v)   (((_v) + 31) & ~31)   /* 32-Bytes aligned */
#define AI_RELOC_ROUND_DOWN_32B(_v) ((_v) & ~31)          /* 32-Bytes aligned */

static void _prepare_input_buffers(struct npu_instance *instance)
{
  if (!instance)
    return;

  for (int i=0; i < instance->info.n_inputs; i++) {
    const LL_Buffer_InfoTypeDef *ll_buf = instance->info.in_bufs[i];
    LL_ATON_Cache_MCU_Clean_Invalidate_Range((uintptr_t)LL_Buffer_addr_start(ll_buf), LL_Buffer_len(ll_buf));
  }

  for (int i=0; i < instance->info.n_outputs; i++) {
    const LL_Buffer_InfoTypeDef *ll_buf = instance->info.out_bufs[i];
    LL_ATON_Cache_MCU_Invalidate_Range((uintptr_t)LL_Buffer_addr_start(ll_buf), LL_Buffer_len(ll_buf));
  }

#ifdef USE_NPU_CACHE
  npu_cache_invalidate();
#endif
}

static void _prepare_output_buffers(struct npu_instance *instance)
{
  return;
}

static void _force_clean_cache_subsystem(struct npu_instance *instance)
{
#ifdef USE_NPU_CACHE
  npu_cache_invalidate();
#endif
  mcu_cache_clean_invalidate();
}


/* -------------------------------------------------------------------------
* Wrapper entry points
* -------------------------------------------------------------------------
*/

