SeongMin1000/N6_cusotm_validation/Projects/STM32N6570-DK/Applications/NPU_Custom_Validation/X-CUBE-AI/atonn/ai_wrapper_ATON.c
/*
* Retrieve and populate an instance of the model.
*
*  'idx'        index of the expected model 0..N
*  'instance'   structure to handle the instance. If the index is
*               valid, the model info is populated.
*
*   if invalid index is provided, -2 is returned else 0.
*
*/
int npu_get_instance_by_index(int idx, struct npu_instance *instance)
{
  if (!instance)
    return -1;

  port_dwt_reset();
  instance->impl = _get_nn_instance(idx);
  instance->install_cycles = port_dwt_get_cycles();

  if (!instance->impl)
    return -2;

  _populate_nn_info(instance);

  instance->state = 0;
  instance->user_cb = NULL;

  return 0;
}

/*
* Retrieve the description of the input LL buffer(s)
*
*  'instance'   structure to handle the instance.
*  'num'        index of the tensor (if =-1, all are returned)
*
*   if invalid NULL is returned
*
*/
const LL_Buffer_InfoTypeDef* npu_get_input_buffers_info(const struct npu_instance *instance, int32_t num)
{
  const LL_Buffer_InfoTypeDef *aton_buf;
  int32_t idx = 0;

  if (!instance)
    return NULL;

  const NN_Instance_TypeDef *nn_inst = instance->impl;

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1
  if (nn_inst->exec_state.inst_reloc != 0)
    aton_buf = &ll_aton_reloc_get_input_buffers_info(nn_inst, -1)[0];
  else
    aton_buf = nn_inst->network->input_buffers_info();
#else
  aton_buf = nn_inst->network->input_buffers_info();
#endif

  if (num < 0)
    return aton_buf;

  for (; aton_buf->name != NULL; aton_buf++) {
    if (aton_buf->is_param == 0) {
      if (idx == num) {
        return aton_buf;
      }
      idx++;
    } else {
      return NULL;
    }
  }
  return NULL;
}

/*
* Retrieve the description of the output LL buffer(s)
*
*  'instance'   structure to handle the instance.
*  'num'        index of the tensor (if =-1, all are returned)
*
*   if invalid NULL is returned
*
*/
const LL_Buffer_InfoTypeDef* npu_get_output_buffers_info(const struct npu_instance *instance, int32_t num)
{
  const LL_Buffer_InfoTypeDef *aton_buf;
  int32_t idx = 0;

  if (!instance)
    return NULL;

  const NN_Instance_TypeDef *nn_inst = instance->impl;

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1
  if (nn_inst->exec_state.inst_reloc != 0)
    aton_buf = &ll_aton_reloc_get_output_buffers_info(nn_inst, -1)[0];
  else
    aton_buf = nn_inst->network->output_buffers_info();
#else
  aton_buf = nn_inst->network->output_buffers_info();
#endif

  if (num < 0)
    return aton_buf;

  for (; aton_buf->name != NULL; aton_buf++) {
    if (aton_buf->is_param == 0) {
      if (idx == num) {
        return aton_buf;
      }
      idx++;
    } else {
      return NULL;
    }
  }
  return NULL;
}

/*
* Retrieve the description of the internal LL buffer(s)
*
*  'instance'   structure to handle the instance.
*  'num'        index of the tensor (if =-1, all are returned)
*
*   if invalid NULL is returned
*
*/
const LL_Buffer_InfoTypeDef* npu_get_internal_buffers_info(const struct npu_instance *instance)
{
  const LL_Buffer_InfoTypeDef *aton_buf;

  if (!instance)
    return NULL;

  const NN_Instance_TypeDef *nn_inst = instance->impl;

#if defined(USE_RELOC_MODE) && USE_RELOC_MODE == 1
  if (nn_inst->exec_state.inst_reloc != 0)
    aton_buf = &ll_aton_reloc_get_internal_buffers_info(nn_inst)[0];
  else
    aton_buf = nn_inst->network->internal_buffers_info();
#else
  aton_buf = nn_inst->network->internal_buffers_info();
#endif

  return aton_buf;
}

/*
* Register the user callback for a given instance.
*/
int npu_set_callback(struct npu_instance *instance, npu_user_cb user_cb)
{
  if (!instance)
    return -1;

  instance->user_cb = user_cb;
  return 0;
}

/*
* Initialize/reset the instance
*
*  mode = 0 - reset/disable the instance
*  mode = 1 - init/install the instance
*             if state==1, instance is re-initialized
*  mode = 2 - reset the instance if state==1
*
*/
int npu_init(struct npu_instance *instance, uint32_t mode)
{
  if (!instance)
    return -1;

  port_dwt_reset();
  if (mode == 0) {
    /* Disable TOP NPU/CACHE clocks */
    instance->state = 0;
    LL_ATON_RT_DeInit_Network(instance->impl);
    LL_ATON_RT_RuntimeDeInit();
    LL_ATON_RT_SetRuntimeCallback((TraceRuntime_FuncPtr_t)NULL);

  } else if (mode == 1) {
    /* reset the NPU IP, CACHE .. */
    /* copy the params/weights in the internal N6 RAM memories */
    /* enable the clocks */
    _force_clean_cache_subsystem(instance);
    port_dwt_init();
    _npu_internal_reset();

    LL_ATON_RT_SetRuntimeCallback(_rt_callback);
    LL_ATON_RT_RuntimeInit();                       // Initialize runtime
    LL_ATON_RT_Init_Network(instance->impl);  // Initialize passed network instance object

    instance->state = 1;
  } else if (mode == 2) {
    if (instance->state == 1) {
      /* reset the NPU cache ... */
      _force_clean_cache_subsystem(instance);
    }
  }
  instance->init_cycles = port_dwt_get_cycles();

  return 0;
}

/*
* Run a simple inference
*/
int npu_run(struct npu_instance *instance, struct npu_counters *counters)
{
  bool should_be_deinit = false;
  LL_ATON_RT_RetValues_t ll_aton_rt_ret = LL_ATON_RT_DONE;

  if (counters)
    memset(counters, 0, sizeof(struct npu_counters));

  if (!instance)
    return -1;

  memset(&g_npu_exec_ctx, 0, sizeof(struct _npu_exec_context));

  if (instance->state == 0) {
    npu_init(instance, 1);
    should_be_deinit = true;
  }

  if (instance->user_cb) {
    g_npu_exec_ctx.user_cb = instance->user_cb;
    g_npu_exec_ctx.mode = instance->option;
    LL_ATON_RT_SetEpochCallback(_epoch_callback, instance->impl);
  } else {
    g_npu_exec_ctx.mode = 0;
  }

  /* --   LL_ATON_RT_Main(); -- */

  uint32_t tick = port_hal_get_tick();
  g_npu_exec_ctx.cpu_cycles_all = 0;
  port_dwt_reset();

  _prepare_input_buffers(instance);

  LL_ATON_RT_Reset_Network(instance->impl);

  // Set bus interface keys -- used for encrypted inference only
  LL_Busif_SetKeys ( 0 , 0 , BUSIF_LSB_KEY , BUSIF_MSB_KEY );
  LL_Busif_SetKeys ( 0 , 1 , BUSIF_LSB_KEY , BUSIF_MSB_KEY );
  LL_Busif_SetKeys ( 1 , 0 , BUSIF_LSB_KEY , BUSIF_MSB_KEY );
  LL_Busif_SetKeys ( 1 , 1 , BUSIF_LSB_KEY , BUSIF_MSB_KEY );

  do {
    /* Execute first/next step of Cube.AI/ATON runtime */
    ll_aton_rt_ret = LL_ATON_RT_RunEpochBlock(instance->impl);

    /* Wait for next event */
    if (ll_aton_rt_ret == LL_ATON_RT_WFE) {
      LL_ATON_OSAL_WFE();
    }
  } while (ll_aton_rt_ret != LL_ATON_RT_DONE);

  _prepare_output_buffers(instance);

  g_npu_exec_ctx.cpu_cycles_all += port_dwt_get_cycles();
  tick = port_hal_get_tick() - tick;

  /* --   LL_ATON_RT_Main(); -- */

  LL_ATON_RT_SetEpochCallback((TraceEpochBlock_FuncPtr_t)NULL, instance->impl);
  g_npu_exec_ctx.user_cb = NULL;

  if (should_be_deinit) {
    npu_init(instance, 0);
  }

  if (ll_aton_rt_ret != LL_ATON_RT_DONE)
    return -1;

  if (counters) {
    g_npu_exec_ctx.cpu_cycles_all += g_npu_exec_ctx.cpu_cycles_start;
    g_npu_exec_ctx.cpu_cycles_all += g_npu_exec_ctx.cpu_cycles_npu;
    g_npu_exec_ctx.cpu_cycles_all += g_npu_exec_ctx.cpu_cycles_end;

    if (instance->user_cb || tick < 3000)  /* CPU cycles are used in this case */
      counters->cpu_all = g_npu_exec_ctx.cpu_cycles_all;
    else { /* get_tick() is used to avoid CPU counter overflow - precision 1ms */
      counters->cpu_all = (uint64_t)tick * (port_hal_get_cpu_freq() / 1000);
    }

    counters->cpu_start = g_npu_exec_ctx.cpu_cycles_start;
    counters->cpu_core = g_npu_exec_ctx.cpu_cycles_npu;
    counters->cpu_end = g_npu_exec_ctx.cpu_cycles_end;
    counters->extra = g_npu_exec_ctx.npu_cycles_all;
  }

  return tick;
}
